# -*- coding: utf-8 -*-


from misc import decode, handle_date, handle_time, handle_version, handle_fp_flags, handle_inn, \
    handle_fr_flags, FuncChain, UNCAST_SIZE


COMMANDS = {
    # 0x10: u'Короткий запрос состояния ФР',
    # 0x11: u'Запрос состояния ФР',
    0x13: u'Гудок',
    # 0x15: u'Чтение параметров обмена',
    # 0x17: u'Печать строки',
    # 0x19: u'Тестовый прогон',
    # 0x1B: u'Запрос операционного регистра',
    # 0x1E: u'Запись таблицы',
    # 0x1F: u'Чтение таблицы',
    # 0x21: u'Программирование времени',
    # 0x22: u'Программирование даты',
    # 0x23: u'Подтверждение программирования даты',
    0x25: u'Отрезка чека',
    # 0x28: u'Открыть денежный ящик',
    # 0x29: u'Протяжка',
    # 0x2B: u'Прерывание тестового прогона',
    # 0x2D: u'Запрос структуры таблицы',
    # 0x2E: u'Запрос структуры поля',
    # 0x40: u'Суточный отчет без гашения',
    # 0x41: u'Суточный отчет с гашением',
    # 0x50: u'Внесение',
    # 0x51: u'Выплата',
    # 0x80: u'Продажа',
    # 0x82: u'Возврат продажи',
    # 0x85: u'Закрытие чека',
    # 0x86: u'Скидка',
    # 0x87: u'Надбавка',
    # 0x88: u'Аннулирование чека',
    # 0x8C: u'Повтор документа',
    # 0x8D: u'Открыть чек',
    # 0xB0: u'Продолжение печати',
    # 0xC2: u'Печать штрих-кода',
    # 0xE0: u'Открыть смену',
    0xFC: u'Получить тип устройства'
}

ERROR_CODE_STR = u'Код ошибки'
ERROR_CODE_STRUCT = (0, None, ERROR_CODE_STR)

HANDLERS = {
    # TODO: написать обработчики режимов ФР
    0x11: (
        ERROR_CODE_STRUCT,
        (1, None, u'Порядковый номер оператора'),
        (slice(2, 4), FuncChain(handle_version, UNCAST_SIZE['11']), u'Версия ПО ФР'),
        (slice(4, 6), UNCAST_SIZE['2'], u'Сборка ПО ФР'),
        (slice(6, 9), FuncChain(handle_date, UNCAST_SIZE['111']), u'Дата ПО ФР'),
        (9, None, u'Номер в зале'),
        (slice(10, 12), UNCAST_SIZE['2'], u'Сквозной номер текущего документа'),
        (slice(12, 14), FuncChain(handle_fr_flags, UNCAST_SIZE['2']), u'Флаги ФР'),
        (14, None, u'Режим ФР'),
        (15, None, u'Подрежим ФР'),
        (16, None, u'Порт ФР'),
        (slice(17, 19), FuncChain(handle_version, UNCAST_SIZE['11']), u'Версия ПО ФП'),
        (slice(19, 21), UNCAST_SIZE['2'], u'Сборка ПО ФП'),
        (slice(21, 24), FuncChain(handle_date, UNCAST_SIZE['111']), u'Дата ПО ФП'),
        (slice(24, 27), FuncChain(handle_date, UNCAST_SIZE['111']), u'Дата'),
        (slice(27, 30), FuncChain(handle_time, UNCAST_SIZE['111']), u'Время'),
        (30, handle_fp_flags, u'Флаги ФП'),
        (slice(31, 35), UNCAST_SIZE['4'], u'Заводской номер'),
        (slice(35, 37), UNCAST_SIZE['2'], u'Номер последней закрытой смены'),
        (slice(37, 39), UNCAST_SIZE['2'], u'Количество свободных записей в ФП'),
        (39, None, u'Количество перерегистраций (фискализаций)'),
        (40, None, u'Количество оставшихся перерегистраций (фискализаций)'),
        (slice(41, 47), handle_inn, u'ИНН')
    ),
    0x13: (
        ERROR_CODE_STRUCT,
        (1, None, u'Порядковый номер оператора'),
    ),
    # TODO: написать обработчики
    0x15: (
        ERROR_CODE_STRUCT,
        (1, None, u'Код скорости обмена'),
        (2, None, u'Тайм аут приема байта')
    ),
    0x25: (
        ERROR_CODE_STRUCT,
        (1, None, u'Порядковый номер оператора'),
    ),
    # TODO: дописать
    0x1F: (
        (slice(0, None), repr, u'Значение'),
    ),
    0xFC: (
        ERROR_CODE_STRUCT,
        (1, None, u'Тип устройства'),
        (2, None, u'Подтип устройства'),
        (3, None, u'Версия протокола для данного устройства'),
        (4, None, u'Подверсия протокола для данного устройства'),
        (5, None, u'Модель устройства'),
        (6, None, u'Язык устройства'),
        (slice(7, None), decode, u'Название устройства')
    )
}
